In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Introduccion a la series de datos

In [ ]:
Estudiantes = pd.Series([16,12,19], index=['Ana','Luis','Carlos']) # Creación de una Serie
print(Estudiantes)

Ana       16
Luis      12
Carlos    19
dtype: int64

In [ ]:
Estudiantes['Luis'] # Acceso por etiqueta

C:\Users\Usuario\AppData\Local\Temp\ipykernel_10504\3554966168.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  Estudiantes[1]

np.int64(12)

In [ ]:
Estudiantes[1] # Acceso por posición

C:\Users\Usuario\AppData\Local\Temp\ipykernel_10504\4221754821.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  Estudiantes[1]

np.int64(12)

In [ ]:
Estudiantes.index # Index(['Ana', 'Luis', 'Carlos'], dtype='object')
Estudiantes.values # array([16, 12, 19], dtype=int64)

array([16, 12, 19])

In [ ]:
Estudiantes.shape #da la cantidad de elementos (3,)

(3,)

## Introduccion a los dataframes

In [ ]:
Estudiantes = pd.DataFrame({'Edad':[16,12,19],
                            'Altura':[1.60,1.70,1.75]}, 
                            index=['Ana','Luis','Carlos']) # Creación de un DataFrame
# Dataframe es una tabla, Serie es una columna
display(Estudiantes) # Muestra el DataFrame en formato tabla
print('hola')

        Edad  Altura
Ana       16    1.60
Luis      12    1.70
Carlos    19    1.75

hola

In [12]:
Estudiantes.dtypes # Muestra los tipos de datos de cada columna

Edad        int64
Altura    float64
dtype: object

In [14]:
Estudiantes.index # Index(['Ana', 'Luis', 'Carlos'], dtype='object')

Index(['Ana', 'Luis', 'Carlos'], dtype='object')

In [15]:
Estudiantes.columns # Index(['Edad', 'Altura'], dtype='object')

Index(['Edad', 'Altura'], dtype='object')

In [16]:
Estudiantes.axes # Muestra los ejes del DataFrame (índices de filas y columnas)

[Index(['Ana', 'Luis', 'Carlos'], dtype='object'),
 Index(['Edad', 'Altura'], dtype='object')]

In [17]:
Estudiantes.values # Muestra los valores del DataFrame como un array de NumPy

array([[16.  ,  1.6 ],
       [12.  ,  1.7 ],
       [19.  ,  1.75]])

## Formas de crear Series y DataFrames

In [18]:
Estudiantes = {'Felipe':14, 'Marta':13, 'Lucia':15}
pd.Series(Estudiantes, index=['Marta','Lucia','Felipe','Ana']) # Creación de una Serie a partir de un diccionario con un índice específico

Marta     13.0
Lucia     15.0
Felipe    14.0
Ana        NaN
dtype: float64

In [19]:
pd.Series(8,index=['a','b','c','d']) # Serie con un valor constante y un índice específico

a    8
b    8
c    8
d    8
dtype: int64

In [22]:
A =np.array([[1,2],[3,4]])
pd.DataFrame(A) # Creación de un DataFrame a partir de un array de NumPy

   0  1
0  1  2
1  3  4

In [23]:
pd.DataFrame(A, index=['Fila1','Fila2'], columns=['Col1','Col2']) # DataFrame con índices y nombres de columnas específicos

       Col1  Col2
Fila1     1     2
Fila2     3     4

## Importacion de datos

In [27]:

%pip install openpyxl

df1 = pd.read_excel("Prueba Santander.xlsx") # Importación de datos desde un archivo Excel
df1

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Collecting et-xmlfile
  Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 21.2.3; however, version 25.2 is available.
You should consider upgrading via the 'c:\Users\Usuario\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

      Id   Nombre       Edad Estatus  Dinero
0      1     Alan  20.000000  Activo    1000
1      2   Marcus  25.000000  Activo    2000
2      3  Loraine  20.000000  Activo    3000
3      4    Maria  22.000000  Activo    4000
4  Total      NaN   5.583333       4   10000

In [45]:
df2 = pd.read_csv("Prueba Santander.csv") # Importación de datos desde un archivo CSV
df2

      Id   Nombre       Edad Estatus  Dinero
0      1     Alan  20.000000  Activo    1000
1      2   Marcus  25.000000  Activo    2000
2      3  Loraine  20.000000  Activo    3000
3      4    Maria  22.000000  Activo    4000
4  Total      NaN   5.583333       4   10000

In [42]:
df2 = pd.read_csv("Prueba Santander.csv", sep=";") # Importación de datos desde un archivo CSV con separador específico
df2.tail() # Muestra las últimas filas del DataFrame
df2.head() # Muestra las primeras filas del DataFrame

      Id,Nombre,Edad,Estatus,Dinero
0           1,Alan,20.0,Activo,1000
1         2,Marcus,25.0,Activo,2000
2        3,Loraine,20.0,Activo,3000
3          4,Maria,22.0,Activo,4000
4  Total,,5.583333333333333,4,10000

In [39]:
df2.shape # Muestra la forma del DataFrame (número de filas y columnas)

(5, 1)

## Inspeccionando un Dataframe

In [46]:
df2 = pd.read_csv("Prueba Santander.csv") # Importación de datos desde un archivo CSV
df2

      Id   Nombre       Edad Estatus  Dinero
0      1     Alan  20.000000  Activo    1000
1      2   Marcus  25.000000  Activo    2000
2      3  Loraine  20.000000  Activo    3000
3      4    Maria  22.000000  Activo    4000
4  Total      NaN   5.583333       4   10000

In [47]:
df2.head() # Muestra las primeras filas del DataFrame

      Id   Nombre       Edad Estatus  Dinero
0      1     Alan  20.000000  Activo    1000
1      2   Marcus  25.000000  Activo    2000
2      3  Loraine  20.000000  Activo    3000
3      4    Maria  22.000000  Activo    4000
4  Total      NaN   5.583333       4   10000

In [ ]:
df2.sample(2) # Muestra una muestra aleatoria de 2 filas del DataFrame

  Id   Nombre  Edad Estatus  Dinero
2  3  Loraine  20.0  Activo    3000
1  2   Marcus  25.0  Activo    2000

In [50]:
df2.describe() # Estadísticas descriptivas del DataFrame

            Edad        Dinero
count   5.000000      5.000000
mean   18.516667   4000.000000
std     7.513968   3535.533906
min     5.583333   1000.000000
25%    20.000000   2000.000000
50%    20.000000   3000.000000
75%    22.000000   4000.000000
max    25.000000  10000.000000

In [51]:
df2.info() # Información sobre el DataFrame, incluyendo tipos de datos y memoria utilizada

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Id       5 non-null      object
 1   Nombre   4 non-null      object
 2   Edad     5 non-null      float64
 3   Estatus  5 non-null      object
 4   Dinero   5 non-null      int64
dtypes: float64(1), int64(1), object(3)
memory usage: 328.0+ bytes

## Accediendo a datos

In [53]:
df3 = pd.read_csv("Prueba Santander.csv")
df3.set_index("Id", inplace=True) # Establece la columna "ID" como índice del DataFrame
display(df3.head())

        Nombre       Edad Estatus  Dinero
Id
1         Alan  20.000000  Activo    1000
2       Marcus  25.000000  Activo    2000
3      Loraine  20.000000  Activo    3000
4        Maria  22.000000  Activo    4000
Total      NaN   5.583333       4   10000

In [54]:
df3['Edad'] # Acceso a una columna específica del DataFrame

Id
1        20.000000
2        25.000000
3        20.000000
4        22.000000
Total     5.583333
Name: Edad, dtype: float64

In [55]:
type(df3['Edad']) # Muestra el tipo de dato de la columna 'Edad' (Series)

pandas.core.series.Series

In [59]:
df3.iloc[1] # Acceso a una fila específica por etiqueta (índice)

Nombre     Marcus
Edad         25.0
Estatus    Activo
Dinero       2000
Name: 2, dtype: object